Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: In Quarkus security, the resource is secured if it is either annotated with one of the security annotations such as `@Authenticated` or its endpoint path is secured in the configured HTTP security policy. The `/login` callback resource is virtual - neither JAX-RS method nor an additional callback handler is allocated to process it, therefore it must be secured with the HTTP security policy configuration, for the Quarkus OIDC authentication mechanism to secure it.
ja_jp: Quarkus セキュリティーでは、 `@Authenticated` などのセキュリティーアノテーションが付けられているか、構成済みの HTTP セキュリティーポリシーでそのエンドポイントパスが保護されている場合に、リソースが保護されます。 `/login` コールバックリソースは仮想的なものです。JAX-RS メソッドも追加のコールバックハンドラーもその処理には割り当てられないため、Quarkus OIDC 認証メカニズムがそれを保護できるように、HTTP セキュリティーポリシー設定で保護する必要があります。

source: In Quarkus such authentication is called `inclusive` and you can enable it like this:
ja_jp: Quarkus では、このような認証は `inclusive` (統合認証) と呼ばれ、次のようにして有効にできます。

source: In Quarkus tests when some service needs to be started before the Quarkus tests are ran, we utilize the `@io.quarkus.test.common.QuarkusTestResource` annotation to specify a `io.quarkus.test.common.QuarkusTestResourceLifecycleManager` which can start the service and supply configuration values that Quarkus will use.
ja_jp: Quarkusのテストを実行する前にサービスを開始する必要がある場合、Quarkusのテストでは、 `@io.quarkus.test.common.QuarkusTestResource` アノテーションを利用して、サービスを開始できる `io.quarkus.test.common.QuarkusTestResourceLifecycleManager` を指定し、Quarkusが使用する設定値を提供します。

source: In Quarkus the `schemaFileName` and `schemaFilePath` attributes should NOT be set on the `AutoProtoSchemaBuilder` annotation. Setting either attributes causes native runtime errors.
ja_jp: Quarkusでは、 `schemaFileName` と `schemaFilePath` 属性は、 `AutoProtoSchemaBuilder` アノテーションに設定すべきではありません。いずれかを設定すると、ネイティブランタイムエラーが発生します。

source: In Quarkus the `schemaFileName` and `schemaFilePath` attributes should NOT be set on the `ProtoSchema` annotation. Setting either attributes causes native runtime errors.
ja_jp: Quarkusでは、 `schemaFileName` および `schemaFilePath` 属性を `ProtoSchema` アノテーションに設定しないでください。どちらの属性を設定しても、ネイティブの実行時エラーが発生します。

source: In Quarkus time, 1.5 means a century ago and we think Fast jar is now ready for prime time and brings enough improvements to justify the change. Thus the decision to make it the default starting with 1.12.
ja_jp: Quarkusの時間軸では、1.5は100年前のことを意味し、Fast jarはもうゴールデンアワーの準備ができており、変更を正当化するのに十分な改善をもたらしていると考えています。そのため、1.12からデフォルトにすることを決定しました。

source: In Quarkus you can achieve the same at the configuration level only without having to modify the code, for example:
ja_jp: Quarkusでは、例えばコードを修正することなく、設定レベルのみで同じことを実現することができます。 :

source: In Quarkus, Envers has a dedicated Quarkus Extension `io.quarkus:quarkus-hibernate-envers`; you just need to add this to your project to start using it.
ja_jp: Quarkusでは、Enversには専用のQuarkus エクステンションがあります。 `io.quarkus:quarkus-hibernate-envers` ; これをプロジェクトに追加して使用を開始する必要があります。

source: In Quarkus, RESTEasy can either run directly on top of the Vert.x HTTP server, or on top of Undertow if you have any servlet dependency.
ja_jp: Quarkus では、 RESTEasy は Vert.x HTTP サーバーの上で直接実行するか、サーブレットに依存している場合は Undertow の上で実行することができます。

source: In Quarkus, `@Param` is optional when parameter names have been compiled to bytecode (which is active by default in generated projects).
ja_jp: Quarkus では、パラメーター名が (生成されたプロジェクトでデフォルトでアクティブになっている) バイトコードにコンパイルされている場合、 `@Param` はオプションです。

source: In Quarkus, a dedicated config property can be used instead: `quarkus.qute.strict-rendering`.
ja_jp: Quarkus では、専用の config プロパティーである `quarkus.qute.strict-rendering` を代わりに使用することができます。

source: In Quarkus, a preconfigured engine instance is provided and available for injection - a bean with scope `@ApplicationScoped`, bean type `io.quarkus.qute.Engine` and qualifier `@Default` is registered automatically. Moreover, all templates located in the `src/main/resources/templates` directory are validated and can be easily injected.
ja_jp: Quarkusでは、事前に設定されたエンジンインスタンスが提供され、インジェクションに利用できます。`@ApplicationScoped` スコープのBean、 `io.quarkus.qute.Engine` 型のBean、 `@Default` 修飾子が自動的に登録されます。さらに、 `src/main/resources/templates` ディレクトリーにあるすべてのテンプレートが検証され、簡単にインジェクションすることができます。

source: In Quarkus, a variant is set automatically for templates located in the `src/main/resources/templates`. By default, the `java.net.URLConnection#getFileNameMap()` is used to determine the content type of a template file. The additional map of suffixes to content types can be set via `quarkus.qute.content-types`.
ja_jp: Quarkusでは、 `src/main/resources/templates` にあるテンプレートに対してバリアントが自動的に設定されます。デフォルトでは、テンプレートファイルのコンテンツタイプを決定するために `java.net.URLConnection#getFileNameMap()` が使用されます。コンテンツタイプへのサフィックスの追加マップは、 `quarkus.qute.content-types` を通じて設定できます。

source: In Quarkus, a variant is set automatically for templates located in the `src/main/resources/templates`. By default, the `java.net.URLConnection#getFileNameMap()` is used to determine the content-type of a template file. The additional map of suffixes to content types can be set via `quarkus.qute.content-types`.
ja_jp: Quarkusでは、 `src/main/resources/templates` にあるテンプレートに対してバリアントが自動的に設定されます。デフォルトでは、テンプレートファイルのコンテンツタイプを決定するために `java.net.URLConnection#getFileNameMap()` が使用されます。コンテンツタイプへのサフィックスの追加マップは、 `quarkus.qute.content-types` を通じて設定できます。

source: In Quarkus, access to the local data is restricted to duplicated contexts. If you try to access local data from a root context, it throws an `UnsupportedOperationException`. It prevents accessing data shared among different units of processing.
ja_jp: Quarkusでは、ローカルデータへのアクセスは複製コンテキストに制限されています。 ルートコンテキストからローカルデータにアクセスしようとすると、 `UnsupportedOperationException` がスローされます。 これにより、異なる処理ユニット間で共有されているデータへのアクセスを防ぎます。

source: In Quarkus, all Jakarta REST resources are treated as CDI beans. It's possible to inject other beans via `@Inject`, bind interceptors using bindings such as `@Transactional`, define `@PostConstruct` callbacks, etc.
ja_jp: Quarkus では、すべての Jakarta REST リソースは CDI Bean として扱われます。`@Inject` を使って他の Bean を注入したり、`@Transactional` などのバインディングを使ってインターセプターをバインドしたり、`@PostConstruct` コールバックを定義したりすることが可能です。

source: In Quarkus, all files from the `src/main/resources/templates/tags` are registered and monitored automatically. For Qute standalone, you need to put the parsed template under the name `itemDetail.html` and register a relevant `UserTagSectionHelper` to the engine:
ja_jp: Quarkus では、`src/main/resources/templates/tags` にあるすべてのファイルが、自動的に登録および監視されます。Qute スタンドアロンでは、解析されたテンプレートを `itemDetail.html` という名前で置き、関連する `UserTagSectionHelper` をエンジンに登録する必要があります。

source: In Quarkus, all templates from the `src/main/resources/templates` are located automatically and the encoding set via `quarkus.qute.default-charset` (UTF-8 by default) is used.
ja_jp: Quarkusでは、 `src/main/resources/templates` のすべてのテンプレートが自動的に配置され、 `quarkus.qute.default-charset` を介して設定されたエンコーディング（デフォルトではUTF-8）が使用されます。

source: In Quarkus, all templates from the `src/main/resources/templates` are located automatically and the encoding set via `quarkus.qute.default-charset` (UTF-8 by default) is used. Custom locators can be <<template-locator-registration,registered>> by using the `@Locate` annotation.
ja_jp: Quarkus では、`src/main/resources/templates` にあるすべてのテンプレートが自動的に配置され、`quarkus.qute.default-charset` (デフォルトは UTF-8) で設定したエンコーディングが使用されます。 カスタムロケーターは、`@Locate` アノテーションを使用して <<template-locator-registration,registered>> を行うことができます。

source: In Quarkus, all templates from the `src/main/resources/templates` are located automatically and the encoding set via `quarkus.qute.default-charset` (UTF-8 by default) is used. Custom locators can be xref:template-locator-registration[registered] by using the `@Locate` annotation.
ja_jp: Quarkusでは、 `src/main/resources/templates` のすべてのテンプレートが自動的に配置され、 `quarkus.qute.default-charset` を介して設定されたエンコーディング（デフォルトではUTF-8）が使用されます。カスタムロケーターは、 `@Locate` のアノテーションを使用して xref:template-locator-registration[登録] できます。

source: In Quarkus, all templates from the `src/main/resources/templates` are located automatically and the encoding set via `quarkus.qute.default-charset` (UTF-8 by default) is used. Custom locators can be <<template-locator-registration,registered>> via the `@Locate` annotation.
ja_jp: Quarkus では、 `src/main/resources/templates` にあるすべてのテンプレートが自動的に配置され、 `quarkus.qute.default-charset` (デフォルトは UTF-8) で設定したエンコーディングが使用されます。カスタムロケーターは、 `@Locate` アノテーションを介して <<template-locator-registration,登録>> することができます。

source: In Quarkus, an implementation detail was exposed by accident: non-application endpoints defined by extensions are based on Vert.x routes. Default path configuration values started with slashes to enable quick route creation and allow simple append behavior. There wasn't anything in the early days of Quarkus to suggest this was a bad idea, and developers with experience in JAX-RS didn't have any warnings one way or the other, because JAX-RS handles it.
ja_jp: Quarkusでは、実装の詳細が偶然にも露わになりました。エクステンションによって定義されたアプリケーション以外のエンドポイントは、Vert.xのルートをベースにしています。デフォルトのパス設定値はスラッシュで始まり、迅速なルート作成を可能にし、単純な追加動作を可能にします。Quarkusの初期の頃は、これが悪い考えであることを示唆するようなものは何もなく、JAX-RSの経験がある開発者は、JAX-RSが処理するので、どちらにしても警告を受けることはありませんでした。

source: In Quarkus, as documented in the <<cdi-injections-reference>>, Baggage can be injected to unwrap data coming with inbound requests but in more complex scenarios were data needs to be sent away in the Baggage manual instrumentation is required.
ja_jp: Quarkus では、<<cdi-injections-reference>> に記載されているように、Baggage は受信リクエストとともに来るデータをアンラップするために注入できますが、Baggage にデータを送る必要があるより複雑なシナリオでは、手動計装が必要です。

source: In Quarkus, it is also possible to define a <<type_safe_fragments,type-safe fragment>>.
ja_jp: Quarkus では、<<type_safe_fragments,type-safe fragment>> も定義できます。

source: In Quarkus, it is also possible to define a xref:type_safe_fragments[type-safe fragment].
ja_jp: Quarkusでは、 xref:type_safe_fragments[タイプセーフフラグメント] を定義することも可能です。

source: In Quarkus, it's possible to change the default strategy via the `quarkus.qute.property-not-found-strategy` as described in the <<configuration-reference>>.
ja_jp: Quarkus では、<<configuration-reference>> で説明しているように、`quarkus.qute.property-not-found-strategy` を使用して、デフォルトのストラテジーを変更することが可能です。

source: In Quarkus, it's possible to change the default strategy via the `quarkus.qute.property-not-found-strategy` as described in the xref:configuration-reference[Configuration Reference].
ja_jp: Quarkusでは、 xref:configuration-reference[設定リファレンス] で説明されているように、 `quarkus.qute.property-not-found-strategy` でデフォルトのストラテジーを変更することが可能です。

source: In Quarkus, the <<engine-customization,`@EngineConfiguration`>> annotation can be used to register a `ValueResolver` implemented as a CDI bean.
ja_jp: Quarkus では、<<engine-customization,`@EngineConfiguration`>> アノテーションを使用して、CDI Bean として実装された `ValueResolver` を登録できます。

source: In Quarkus, the CDI request scope is stored in a duplicated context, meaning it gets automatically propagated alongside the reactive processing of a request.
ja_jp: Quarkusでは、CDIリクエストスコープは複製コンテキストに保存されます。つまり、リクエストのリアクティブ処理と同時に、CDIリクエストスコープが自動的に伝搬されます。

source: In Quarkus, the MDC provider has a specific implementation for handling the reactive context, ensuring that MDC data is propagated during reactive and asynchronous processing.
ja_jp: Quarkusでは、MDCプロバイダにはリアクティブコンテキストを処理するための特別な実装があり、リアクティブ処理や非同期処理中にMDCデータが確実に伝搬されます。

source: In Quarkus, the Quarkus REST extension and xref:rest-client.adoc[the REST Client extension] share the same infrastructure. One important consequence of this consideration is that they share the same list of providers (in the Jakarta REST meaning of the word).
ja_jp: Quarkusでは、Quarkus REST エクステンションと xref:rest-client.adoc[REST Clientエクステンション] は、同じインフラストラクチャを共有しています。この考慮の重要な結果 の1 つは、（Jakarta REST の意味での）プロバイダーのリストを共有することです。

source: In Quarkus, the REST Client extension and xref:rest-json.adoc[the RESTEasy extension] share the same infrastructure. One important consequence of this consideration is that they share the same list of providers (in the JAX-RS meaning of the word).
ja_jp: Quarkus では、REST Client エクステンションと xref:rest-json.adoc[RESTEasy エクステンション]は同じインフラストラクチャーを共有しています。この考察の重要な結果の1つは、 JAX-RS の意味においての同じプロバイダーリストを共有していることです。

source: In Quarkus, the REST Client extension and xref:rest-json.adoc[the RESTEasy extension] share the same infrastructure. One important consequence of this consideration is that they share the same list of providers (in the Jakarta REST meaning of the word).
ja_jp: Quarkusでは、REST Clientエクステンションと xref:rest-json.adoc[RESTEasyエクステンション] は、同じインフラストラクチャを共有しています。この考慮の重要な結果の1つは、（Jakarta RESTの意味での）プロバイダのリストを共有することです。

source: In Quarkus, the RESTEasy Reactive extension and xref:rest-client-reactive.adoc[the REST Client Reactive extension] share the same infrastructure. One important consequence of this consideration is that they share the same list of providers (in the JAX-RS meaning of the word).
ja_jp: Quarkus では、RESTEasy Reactive エクステンションと xref:rest-client-reactive.adoc[REST クライアントリアクティブエクステンション] は同じインフラストラクチャを共有しています。この考慮の重要な結果の一つは、(JAX-RS の意味での) プロバイダーのリストを共有しているということです。

source: In Quarkus, the RESTEasy Reactive extension and xref:rest-client-reactive.adoc[the REST Client Reactive extension] share the same infrastructure. One important consequence of this consideration is that they share the same list of providers (in the Jakarta REST meaning of the word).
ja_jp: Quarkusでは、RESTEasy Reactiveエクステンションと xref:rest-client-reactive.adoc[REST Client Reactive] エクステンションは、同じインフラストラクチャを共有しています。この考慮の重要な結果の1つは、（Jakarta RESTの意味での）プロバイダのリストを共有することです。

source: In Quarkus, the RESTEasy extension and xref:rest-client.adoc[the REST Client extension] share the same infrastructure. One important consequence of this consideration is that they share the same list of providers (in the JAX-RS meaning of the word).
ja_jp: Quarkus では、 RESTEasy エクステンションと xref:rest-client.adoc[REST Client エクテンション]は同じインフラストラクチャーを共有しています。この考察の重要な結果の1つは、 JAX-RS の意味においての同じプロバイダーリストを共有していることです。

source: In Quarkus, the RESTEasy extension and xref:rest-client.adoc[the REST Client extension] share the same infrastructure. One important consequence of this consideration is that they share the same list of providers (in the Jakarta REST meaning of the word).
ja_jp: Quarkusでは、RESTEasyエクステンションと xref:rest-client.adoc[REST Clientエクステンション] は、同じインフラストラクチャを共有しています。この考慮の重要な結果の1つは、（Jakarta RESTの意味での）プロバイダーのリストを共有することです。

source: In Quarkus, the RESTEasy extension and xref:resteasy-client.adoc[the REST Client extension] share the same infrastructure. One important consequence of this consideration is that they share the same list of providers (in the Jakarta REST meaning of the word).
ja_jp: Quarkus では、RESTEasy エクステンションと xref:resteasy-client.adoc[REST クライアントエクステンション] が同じインフラストラクチャーを共有します。 この考慮事項の重要な影響の 1 つは、それらが (Jakarta REST の意味において) 同じプロバイダーのリストを共有することです。

source: In Quarkus, the `quarkus-load-shedding` extension provides a load shedding mechanism.
ja_jp: Quarkus では、 `quarkus-load-shedding` エクステンションによって負荷制限メカニズムが提供されます。

source: In Quarkus, the application is represented by a single bean archive with the https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html#default_bean_discovery[bean discovery mode `annotated`, window="_blank"]. Therefore, bean classes that don't have a https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html#bean_defining_annotations[bean defining annotation, window="_blank"] are ignored. Bean defining annotations are declared on the class-level and include scopes, stereotypes and `@Interceptor`.
ja_jp: Quarkusでは、アプリケーションは https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html#default_bean_discovery[Bean 検出モード `annotated`, window="_blank"] でアノテーションされた単一の Bean アーカイブで表現されます。したがって、 https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html#bean_defining_annotations[Bean 定義アノテーション, window="_blank"] を持たない Bean クラスは無視されます。Bean 定義アノテーションはクラスレベルで宣言され、スコープ、ステレオタイプ、 `@Interceptor` を含みます。

source: In Quarkus, the application is represented by a single bean archive with the https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html#default_bean_discovery[bean discovery mode `annotated`, window="_blank"]. Therefore, bean classes that don't have a https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html#bean_defining_annotations[bean defining annotation, window="_blank"] are ignored. Bean defining annotations are declared on the class-level and include scopes, stereotypes and `@Interceptor`.
ja_jp: Quarkus では、アプリケーションは https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html#default_bean_discovery[Bean 検出モード `annotated`, window="_blank"] でアノテーションされた単一の Bean アーカイブで表現されます。 したがって、 https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html#bean_defining_annotations[Bean 定義アノテーション, window="_blank"] を持たない Bean クラスは無視されます。 Bean 定義アノテーションはクラスレベルで宣言され、スコープ、ステレオタイプ、 `@Interceptor` が含まれます。

source: In Quarkus, the default Jackson `ObjectMapper` obtained via CDI (and consumed by the Quarkus extensions) is configured to ignore unknown properties (by disabling the `DeserializationFeature.FAIL_ON_UNKNOWN_PROPERTIES` feature).
ja_jp: Quarkusでは、CDI経由で取得した(そしてQuarkusのエクステンションによって消費される)デフォルトのJackson `ObjectMapper` は、未知のプロパティーを無視するように設定されています( `DeserializationFeature.FAIL_ON_UNKNOWN_PROPERTIES` 機能を無効にすることで)。

source: In Quarkus, the default Jackson `ObjectMapper` obtained via CDI (utilized by Quarkus extensions) is set to ignore unknown properties (by disabling `DeserializationFeature.FAIL_ON_UNKNOWN_PROPERTIES`).
ja_jp: Quarkus では、CDI 経由で取得された (Quarkus エクステンションによって利用される) デフォルトの Jackson `ObjectMapper` は、(`DeserializationFeature.FAIL_ON_UNKNOWN_PROPERTIES` を無効にして) 不明なプロパティーを無視するように設定されています。

source: In Quarkus, the default behavior can be disabled by setting the property `quarkus.qute.remove-standalone-lines` to `false`. In this case, all whitespace characters from a standalone line will be printed to the output.
ja_jp: Quarkusでは、プロパティー( `quarkus.qute.remove-standalone-lines` )を `false` に設定することで、デフォルトの動作を無効にすることができます。この場合、スタンドアロン行のすべての空白文字が出力されます。

source: In Quarkus, the default timeout can be set via the `io.quarkus.qute.timeout` configuration property. If using Qute standalone then the `EngineBuilder#timeout()` method can be used.
ja_jp: Quarkus では、デフォルトのタイムアウトは `io.quarkus.qute.timeout` 設定プロパティーで設定することができます。Qute をスタンドアロンで使用する場合は、`EngineBuilder#timeout()` メソッドを使用することができます。

source: In Quarkus, the entity loader mentioned in Hibernate Search's reference documentation can be defined as a <<plugging-in-custom-components,CDI bean>>, but will still need to be attached to particular entities using `@SearchEntity(loadingBinder = ...)`.
ja_jp: Quarkus では、Hibernate Search の参照ドキュメントに記載されているエンティティーローダーは、 <<plugging-in-custom-components,CDI bean>> のように定義できますが、 `@SearchEntity(loadingBinder = ...)` を使用して特定のエンティティーにアタッチする必要があります。

source: In Quarkus, the most common ways to obtain an application logger are by:
ja_jp: Quarkusでは、アプリケーションロガーを取得する最も一般的な方法は以下のとおりです：

source: In Quarkus, the namespace resolvers are automatically registered for namespaces `frg`, `fragment`, `cap` and `capture`.
ja_jp: Quarkus では、名前空間リゾルバが名前空間 `frg` 、 `fragment` 、 `cap` 、 `capture` に対して自動的に登録されます。

source: In Quarkus, the support of virtual thread is implemented using the link:{runonvthread}[@RunOnVirtualThread] annotation. This section briefly overviews the rationale and how to use it. There are dedicated guides for extensions supporting that annotation, such as:
ja_jp: Quarkus では、仮想スレッドのサポートは link:{runonvthread}[@RunOnVirtualThread] アノテーションを使用して実装されています。 このセクションでは、その論理的根拠と使い方について簡単に説明します。 このアノテーションをサポートするエクステンションには、以下のような専用のガイドも用意されています。

source: In Quarkus, there is a preconfigured `Engine` available for injection - see <<quarkus_integration>>.
ja_jp: Quarkus では、インジェクション用にあらかじめ設定された `Engine` が用意されています。<<quarkus_integration>> を参照してください。

source: In Quarkus, there is a preconfigured `Engine` available for injection - see xref:quarkus_integration[Quarkus Integration].
ja_jp: Quarkusでは、注入用にあらかじめ設定された `Engine` が用意されています（ xref:quarkus_integration[Quarkus統合] を参照）。

source: In Quarkus, we can index the annotations with Jandex so, in a perfect world, we would index the GitHub API jar with Jandex (which we already do for other purposes) and interrogate Jandex to get all the methods annotated with `@WithBridgeMethods`:
ja_jp: Quarkusでは、Jandexでアノテーションのインデックスを作成できます。完璧な世界では、JandexでGitHub API jarのインデックスを作成し（他の目的ですでに行っています）、Jandexに問い合わせて、 `@WithBridgeMethods` でアノテーションされたすべてのメソッドを取得することができます。

source: In Quarkus, we generate a significant amount of bytecode, and for large applications you need to be careful, as scale can cause our generated bytecode to hit certain limits (for example, method size or class size limits).
ja_jp: Quarkusでは、かなりの量のバイトコードを生成します。大規模なアプリケーションでは注意が必要で、規模が大きくなると、生成されたバイトコードが特定の制限（例えば、メソッドサイズやクラスサイズの制限）に達する可能性があります。

source: In Quarkus, we have a few class loader tricks to mitigate this. But in the general case, you have to deal with it.
ja_jp: Quarkus では、これを軽減するためのクラスローダーのトリックをいくつか持っています。しかし、一般的なケースでは、それに対処する必要があります。

source: In Quarkus, we've integrated Project Leyden AOT so that:
ja_jp: Quarkus では、Project Leyden AOT を統合しました。これにより、

source: In Quarkus, when using Leyden, we decided to generate empty `package-info` classes for all packages containing entities that don't already have one. This way, Hibernate ORM doesn't have to attempt to load non-existing classes.
ja_jp: Quarkus で Leyden を使用する場合、エンティティを含むすべてのパッケージに対して、まだ存在しない場合に空の `package-info` クラスを生成することにしました。これにより、Hibernate ORM は存在しないクラスをロードしようとする必要がなくなります。

source: In Quarkus, when you execute reactive code, you run in a _Context_, representing the execution thread (event loop or worker thread).
ja_jp: Quarkusでは、リアクティブコードを実行すると、実行スレッド（イベントループまたはワーカースレッド）を表す _コンテキスト_ で実行されます。

source: In Quarkus, you can simply inject the template definition. The template is automatically parsed and cached - see <<quarkus_integration>>.
ja_jp: Quarkus では、テンプレートの定義を単純に注入することができます。テンプレートは自動的に解析され、キャッシュされます。<<quarkus_integration>> を参照してください。

source: In Quarkus, you can simply inject the template definition. The template is automatically parsed and cached - see xref:quarkus_integration[Quarkus Integration].
ja_jp: Quarkusでは、テンプレート定義を単純に注入することが出来ます。テンプレートは自動的に解析され、キャッシュされます - xref:quarkus_integration[Quarkus Integration] を参照してください。

source: In Quarkus, you can skip the `@Inject` annotation completely if the injected field declares at least one qualifier.
ja_jp: Quarkus では、注入されたフィールドが少なくとも 1 つの修飾子を宣言している場合は、 `@Inject` アノテーションを完全にスキップすることができます。

source: In Quarkus, you can skip the `@Produces` annotation completely if the producer method is annotated with a scope annotation, a stereotype or a qualifier.
ja_jp: Quarkus では、producer メソッドにスコープアノテーション、ステレオタイプ、または修飾子が付いている場合は、 `@Produces` アノテーションを完全に省略できます。

source: In Quarkus, you can use the SmallRye Fault Tolerance optional features out of the box.
ja_jp: Quarkusでは、SmallRye Fault Toleranceのオプション機能をすぐに使用することができます。

source: In Quarkus, you just need to:
ja_jp: Quarkusでは、以下を実施するだけです:

source: In Quarkus, you only need to:
ja_jp: Quarkusでは、以下の点のみを実行します。

source: In RESTEasy Reactive however you can simply do something like:
ja_jp: しかし、RESTEasy Reactive では、次のようなことができます:

source: In Spring Data JPA this is done by registering a class that extends `org.springframework.data.jpa.repository.support.SimpleJpaRepository` however in Quarkus this class is not used at all (since all the necessary plumbing is done at build time). Similar support might be added to Quarkus in the future.
ja_jp: Spring Data JPA では、これは `org.springframework.data.jpa.repository.support.SimpleJpaRepository` を拡張するクラスを登録することによって行われますが、Quarkus ではこのクラスはいっさい使用されません (必要な配置設定はすべてビルド時に行われるため)。将来、同様のサポートが Quarkus に追加される可能性があります。
